-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: cinemadata
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `places`
--

DROP TABLE IF EXISTS `places`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `places` (
  `Location` int DEFAULT NULL,
  `Name` varchar(250) DEFAULT NULL,
  `ID` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=303 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `places`
--

LOCK TABLES `places` WRITE;
/*!40000 ALTER TABLE `places` DISABLE KEYS */;
INSERT INTO `places` VALUES (6,'കോട്ടയം',48),(6,'ചങ്ങനാശ്ശേരി',49),(6,'മുണ്ടക്കയം',50),(6,'തലയോലപ്പറമ്പ്',51),(6,'പാലാ',52),(6,'പൊൻകുന്നം',53),(6,'ഈരാറ്റുപേട്ട',54),(6,'ഏറ്റുമാനൂർ',55),(6,'പള്ളിക്കത്തോട്',129),(6,'നെടുംങ്കണ്ടം',130),(6,'കട്ടപ്പന',131),(6,'തൊടുപുഴ',132),(6,'ഇടുക്കി',133),(6,'കുറവിലങ്ങാട്',134),(6,'കൂത്താട്ടുകുളം',135),(2,'സുൽത്താൻ ബത്തേരി',136),(2,'കൽപ്പറ്റ',137),(2,'മാനന്തവാടി',138),(2,'പുൽപ്പള്ളി',139),(2,'കോഴിക്കോട്',140),(2,'ബാലുശ്ശേരി',141),(2,'കൊയിലാണ്ടി',142),(2,'വടകര',143),(2,'കക്കട്ടിൽ',144),(2,'കുന്നമംഗലം',145),(2,'മുക്കം',146),(2,'മെഡിക്കൽ കോളജ്',147),(2,'രാമനാട്ടുകര',148),(3,'കൂത്താട്ടുകുളം',159),(3,'കോതമംഗലം',160),(3,'മൂവാറ്റുപുഴ',161),(3,'പെരുമ്പാവൂർ',162),(3,'പട്ടിമറ്റം',163),(3,'ആരക്കുന്നം',164),(3,'ഇടപ്പള്ളി ടോൾ',165),(3,'ആലുവ',166),(3,'ഞാറയ്ക്കൽ',167),(3,'അയ്യമ്പിള്ളി',168),(3,'പറവൂർ',169),(3,'വരാപ്പുഴ',170),(3,'മൂക്കന്നൂർ',171),(3,'കാലടി',172),(3,'എറണാകുളം',174),(3,'തൃപ്പൂണിത്തുറ',175),(3,'മരട്',176),(3,'പള്ളുരുത്തി',177),(3,'കൊച്ചി',178),(3,'ചേർത്തല',179),(3,'ഏരമല്ലൂർ',180),(4,'ചെറുവത്തൂർ',182),(4,'തളിപറമ്പ്',183),(4,'ആലക്കോട്',185),(2,'എടച്ചേര‌ി',186),(2,'ഫറോക്ക്',187),(7,'പൊന്നാനി',188),(7,'എടപ്പാൾ',189),(7,'ചങ്ങരംകുളം',190),(7,'തിരൂർ',191),(7,'കോട്ടയ്ക്കൽ ',192),(7,'പരപ്പനങ്ങാടി',193),(7,'രാമനാട്ടുകര',194),(7,'മലപ്പുറം',195),(7,'പെരിന്തൽമണ്ണ',196),(7,'മഞ്ചേരി',197),(7,'നിലമ്പൂർ',198),(7,'വണ്ടൂർ',199),(7,'എടവണ്ണ',200),(7,'പാണ്ടിക്കാട്',201),(7,'മേലാറ്റൂർ',202),(7,'പൂക്കോട്ടുംപാടം',203),(7,'കൊണ്ടോട്ടി',204),(7,'കോഴിക്കോട് മെഡിക്കൽ കോളജ്',205),(6,'പിറവം',206),(1,'ചെങ്ങന്നൂർ',207),(1,'ഹരിപ്പാട്',208),(1,'കറ്റാനം',209),(1,'കടപ്ര',210),(1,'മാവേലിക്കര',211),(1,'പന്തളം',212),(1,'തിരുവല്ല',213),(1,'ആലപ്പുഴ',214),(1,'കരുനാഗപ്പള്ളി',215),(1,'ചേർത്തല',216),(1,'എരമല്ലുർ',217),(9,'പത്തനംതിട്ട',218),(9,'ചങ്ങനാശ്ശേരി',219),(9,'കോട്ടയം',220),(9,'മാവേലിക്കര',221),(9,'കടപ്ര',222),(9,'ചെങ്ങന്നൂർ',223),(9,'തിരുവല്ല',224),(9,'പത്തനാപുരം',225),(9,'അടൂർ',226),(9,'പന്തളം',227),(9,'കറ്റാനം',228),(9,'റാന്നി',229),(9,'നൂറനാട്',230),(8,'പാലക്കാട്',231),(8,'പെരിങ്ങോട്ടുകുർശ്ശി',232),(8,'കോട്ടായി',233),(8,'കല്ലടിക്കോട്',234),(8,'പുതുനഗരം',235),(8,'എലപ്പുള്ളി',236),(8,'കൊല്ലങ്കോട്',237),(8,'തൃപ്പാളൂർ',238),(8,'വടക്കഞ്ചേരി',239),(8,'ചിറ്റൂർ',240),(8,'കൊഴിഞ്ഞാമ്പാറ',241),(8,'പഴയന്നൂർ',242),(8,'മണ്ണാർക്കാട്',243),(8,'ചെമ്പകശ്ശേരി',244),(8,'അട്ടപ്പാടി',245),(8,'ചെർപ്പുളശ്ശേരി',246),(8,'ചേലൂർ',247),(8,'മായന്നൂർ',248),(8,'ഒറ്റപ്പാലം',249),(8,'പട്ടാമ്പി',250),(8,'കൊപ്പം',251),(8,'ഷൊർണ്ണൂർ',252),(1,'നൂറനാട്',254),(1,'കായംകുളം',255),(10,'ഇരിങ്ങാലക്കുട',256),(10,'ഇരിങ്ങാലക്കുട(കിഴുത്താണി)',257),(10,'ചെന്ത്രാപ്പിന്നി',258),(10,'ചാലക്കുടി',259),(10,'കൊടുങ്ങല്ലൂർ',260),(10,'മാള',261),(10,'അഷ്ടമിച്ചിറ',262),(10,'കാഞ്ഞാണി',263),(10,'പെരിങ്ങോട്ടുകര',264),(10,'തൃപ്രയാർ',265),(10,'നാട്ടിക',266),(10,'തളിക്കുളം',267),(10,'വാടാനപ്പള്ളി',268),(10,'ഗുരുവായൂർ',269),(10,'കേച്ചേരി',270),(10,'കുന്നംകുളം',271),(10,'ഷൊർണ്ണൂർ',272),(10,'പഴയന്നൂർ',273),(10,'മായന്നൂർ',274),(10,'തൃശ്ശൂർ',275),(10,'ഊരകം',277),(10,'ഒല്ലൂർ',278),(10,'ആമ്പല്ലൂർ',279),(10,'വരന്തരപ്പിള്ളി',280),(4,'കാസർക്കോട്',281),(4,'കണ്ണൂർ',282),(4,'മട്ടന്നൂർ',283),(4,'പേരാവൂർ',284),(4,'തലശ്ശേരി',285),(4,'കൂത്തുപറമ്പ്',286),(5,'കൊല്ലം',287),(5,'നല്ലില',288),(5,'പരവൂർ',289),(5,'ഓയൂർ',290),(5,'ചാത്തന്നൂർ',291),(5,'കൊട്ടാരക്കര',292),(5,'പത്തനാപുരം',293),(5,'പുനലൂർ',294),(5,'അഞ്ചൽ',295),(5,'പുത്തൂർ',296),(5,'കരുനാഗപ്പള്ളി',297),(5,'നൂറനാട്',298),(3,'മഞ്ഞപ്ര',299),(3,'കൊടുങ്ങല്ലൂ‌‍ർ',300),(10,'മാപ്രാണം',302);
/*!40000 ALTER TABLE `places` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-06 14:09:32
